from __future__ import annotations
from engine.nodes.node_spec import node_spec
from plugins.nodes.shared.client_执行节点_impl_helpers import *
from engine.utils.logging.logger import log_info

@node_spec(
    name="指定挂接点打攻击盒",
    category="执行节点",
    inputs=[("流程入", "流程"), ("目标阵营筛选", "枚举"), ("挂接点名称", "字符串"), ("挂接点偏移", "三维向量"), ("挂接点旋转", "三维向量"), ("伤害系数", "浮点数"), ("伤害增量", "浮点数"), ("攻击盒实体类型筛选列表", "阵营列表"), ("触发类型", "枚举"), ("命中场景特效", "整数"), ("攻击盒类型", "枚举"), ("攻击盒为长方体时的缩放", "枚举"), ("攻击盒为球体时的半径", "布尔值"), ("攻击盒为扇形时的高度", "浮点数"), ("攻击盒为扇形时的扇角度", "浮点数"), ("攻击盒为扇形时的扇半径", "浮点数"), ("攻击盒为扇形时的内半径", "浮点数"), ("攻击盒为扇形时的检测方向", "枚举"), ("攻击层筛选", "枚举"), ("攻击标签列表", "字符串列表"), ("元素类型", "枚举"), ("元素攻击强效", "浮点数"), ("打击类型", "枚举"), ("攻击类型", "枚举"), ("打断值", "浮点数"), ("是否是绝对伤害", "布尔值"), ("命中特效", "整数"), ("受击击退朝向", "枚举"), ("是否屏蔽伤害跳字", "布尔值"), ("命中场景特效偏移", "三维向量"), ("命中场景特效旋转", "三维向量"), ("命中场景特效缩放", "浮点数"), ("命中特效偏移", "三维向量"), ("命中特效旋转", "三维向量"), ("命中特效缩放", "浮点数"), ("本次攻击的仇恨倍率", "浮点数"), ("本次攻击的仇恨增量", "整数"), ("受击等级", "枚举"), ("命中水平冲量", "浮点数"), ("命中垂直冲量", "浮点数")],
    outputs=[("流程出", "流程")],
    description="对指定挂接点发起一次攻击盒攻击，可以设置该次攻击的各种参数",
    doc_reference="客户端节点/执行节点/执行节点.md"
)
def 指定挂接点打攻击盒(game, 目标阵营筛选, 挂接点名称, 挂接点偏移, 挂接点旋转, 伤害系数, 伤害增量, 攻击盒实体类型筛选列表, 触发类型, 命中场景特效, 攻击盒类型, 攻击盒为长方体时的缩放, 攻击盒为球体时的半径, 攻击盒为扇形时的高度, 攻击盒为扇形时的扇角度, 攻击盒为扇形时的扇半径, 攻击盒为扇形时的内半径, 攻击盒为扇形时的检测方向, 攻击层筛选, 攻击标签列表, 元素类型, 元素攻击强效, 打击类型, 攻击类型, 打断值, 是否是绝对伤害, 命中特效, 受击击退朝向, 是否屏蔽伤害跳字, 命中场景特效偏移, 命中场景特效旋转, 命中场景特效缩放, 命中特效偏移, 命中特效旋转, 命中特效缩放, 本次攻击的仇恨倍率, 本次攻击的仇恨增量, 受击等级, 命中水平冲量, 命中垂直冲量):
    """对指定挂接点发起一次攻击盒攻击，可以设置该次攻击的各种参数"""
    log_info(f"[指定挂接点打攻击盒] 执行")
